Autodesk.Revit.DB.BuiltInFailures.SheetCollectionFailures.SheetCollectionDuplicateName
Sheet Collection name is already in use. Provide a unique name.

Autodesk.Revit.DB.BuiltInFailures.SheetCollectionFailures
Failures about SheetCollection.